import Layout from '@/components/Layout'
import { useRouter } from 'next/router'
import Image from 'next/image'

const About = () => {
  const router = useRouter()
  return (
    <Layout
      title={router.locale === 'ru-RU' ? 'О нас' : 'About us'}
      description={
        router.locale === 'ru-RU'
          ? 'Информация о макетной студии Спутник'
          : 'About Sputnik maket studio'
      }
      keywords='макеты,сувенирные макеты, макеты космических аппаратов'
    >
      {router.locale === 'ru-RU' ? (
        <div className='row'>
          <h1 className='my-3'>О макетной компании "Спутник"</h1>
          <hr />
          <div className='row'>
            <div className='col-12 col-md-4 py-2'>
              <Image
                src='/images/about_us.jpg'
                width='400px'
                height='600px'
                priority='true'
              />
            </div>
            <div className='col-12 col-md-8 py-1 px-5'>
              <p className='lead'>
                <strong>Макетная мастерская «Спутник»</strong> - молодая
                быстроразвивающаяся компания, объединившая под своим началом
                лучших моделистов города Самара, космической столицы России.
              </p>
              <p className='lead'>
                У нас трудятся высококвалифицированные специалисты, знатоки
                своего дела, для которых создание масштабных моделей не только
                работа.
              </p>
              <p className='lead'>
                Мы изготавливаем высокодетализированные макеты для выставок,
                музейные экспонаты, полноразмерные макеты, VIP-сувениры и
                наградную продукцию. На сегодняшний день мы можем воссоздать
                практический любой макет, от сувенирного изделия до модели в
                масштабе (1:1) с высокой степенью проработки.
              </p>
              <p className='lead'>
                Спектр работ нашей макетной компании составляют модели
                ракетно-космической тематики, авиационной и судостроительной
                техники, промышленные и военные макеты, макеты оборудования.
              </p>
              <p className='lead'>
                Наша макетная мастерская это современное производство. Мы
                работаем на станках ЧПУ, станках лазерной и фрезерной резки,
                используем 3Д принтеры и ротационные машины. Мы сотрудничаем как
                с предприятиями ракетно-космической отрасли, производственными
                организациями, так и с частными заказчиками.
              </p>
            </div>
          </div>
        </div>
      ) : (
        <h1>About Sputnik company</h1>
      )}
    </Layout>
  )
}

export default About
